app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date
---
  def index
    @movies = Movie.order(params[:sort_by])
    @sorted_column = params[:sort_by]
    if params[:ratings]
      @movies = Movie.where(:rating => params[:ratings].keys).find(:all, :order => (params[:sort_by]))